_posts/programming/2024-01-27-cppcoreguidelines-nl10.html
---
layout: post
title: CppCoreGuidelines NL.10 建议用下划线命名风格 underscore_style
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Prefer underscore_style names&rdquo;
</p>

<p>
理由
</p>

<p>
C 和 C++ 传统风格是用下划线分隔名称中的单词。 C++ 库也用这种风格。
</p>


<p>
注意
</p>

<p>
只有你可以选的时候，才能采用此做法。如果你没得选，那就遵循已经建立的风格，保证一致性。风格一致性胜过个人品味。
</p>

<p>
只有当你没有其他限制或其他更好的想法的时候，选用此建议。这条规则是在很多人要求添加的。
</p>


<p>
例子
</p>

<p>
Stroustrup 说：这条符合 ISO 标准。但是在自己定义的类型和概念 concept
中用大写字母开头：
</p>
<ul class="org-ul">
<li><code>int</code></li>
<li><code>vector</code></li>
<li><code>My_map</code></li>
</ul>

<p>
强化  
</p>

<p>
没法强化。
</p>
